Revit 2024 API
ScheduleHeightsOnSheet.GetBodyRowHeights Method
 Returns each row's height of schedule body on sheet view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public IList<double> GetBodyRowHeights()
Visual Basic
Public Function GetBodyRowHeights As IList(Of Double)
Visual C++
public:
IList<double>^ GetBodyRowHeights()
Return Value
 Each row's height of schedule body on sheet view.
See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace